app/controllers/api/v1/potlucks_controller.rb

  def index
    potlucks = Potluck.all
---
SELECT "potlucks".* FROM "potlucks"

  def show
    potluck = Potluck.find(params[:id])
---
SELECT  "potlucks".* FROM "potlucks" WHERE "potlucks"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    potluck = Potluck.create(potluck_params)
---
INSERT INTO "potlucks" ("name", "date", "time", "location", "description") VALUES (?, ?, ?, ?, ?)  [["name", "Test"], ["date", "test"], ["time", "test"], ["location", "testt"], ["description", "test"]]